archive/before-2018-11-10/source/2017-06-29-my-saved-website.org
#+AUTHOR: Peng Xie
#+EMAIL: pengpengxpplay@gmail.com
#+SETUPFILE: theme.setup
#+OPTIONS: ^:{}
#+TODO: 未读 | 已读
#+TITLE: 我的Bookmarks


* [[http://zhidao.baidu.com/question/32098049.html][2016-09-27 等额本息还贷和等额本金还贷有什么区别?]]                  :fangdai:
* [[http://ergoemacs.org/misc/programer_workflow_efficiency.html][2016-09-27 Programer Workflow Efficiency]]                   :emacs_workflow:
* [[https://coderwall.com/p/vbndzq/emacs-daemon-macosx-workflow][2016-09-27 Emacs Daemon MacOSX Workflow]]                    :emacs_workflow:
* [[http://stackoverflow.com/questions/2014636/how-to-maintain-an-emacs-based-knowledge-base][2016-09-27 org mode - How to maintain an emacs-based knowledge base? - Stack Overflow]] :knowledgemanagement:
* [[http://emacsist.com/10284][2016-09-27 Use Emacs's Org-mode to Effectively Manage Small Projects - Emacs & Emacsist]] :knowledgemanagement:
* [[http://www.excelhome.net/][2016-09-28 ExcelHome - 全球领先的Excel门户,Office视频教程培训中心]]   :excel:
* [[https://www.zhihu.com/question/21745865][2016-09-28 (1 条消息) 等额本息与等额本金，从财务管理的角度充分考虑货币时间价值，哪个对于购房人来说更划算？ - 知乎]] :fangdai:
* [[http://blog.csdn.net/whiterbear/article/details/49356815][2016-09-29 Mac下iPython－notebook搭建及使用 - whiterbear的专栏 - 博客频道 - CSDN.NET]] :ipython:notebook:
* [[http://mindonmind.github.io/2013/02/08/ipython-notebook-interactive-computing-new-era/][2016-09-29 IPython Notebook: 交互计算新时代 | Mind on Mind]]       :notebook:
* [[http://172.16.2.250/NewComer/][2016-09-29 Index of /NewComer]]                               :reversecurity:
* [[https://jsuper.github.io/emacs/using-org-mode-to-write-jekyll-post.html][2016-09-30 使用org-mode撰写jekyll博客]]               :jekyll:org:mode:emacs:
* [[https://rubygems.org/gems][2016-10-01 Gems | RubyGems.org | Ruby 社区 Gem 托管]]        :ruby:gemsource:
* 未读 [[https://wsgzao.github.io/post/fq/][2016-10-06 GFW翻墙小结 | HelloDog]]                                :gfw:
