archive/before-2018-11-10/2017-06-29-my-saved-website.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>我的Bookmarks</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">我的Bookmarks</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5b00cb5">1. 2016-09-27 等额本息还贷和等额本金还贷有什么区别?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="fangdai">fangdai</span></span></a></li>
<li><a href="#org15e0e5c">2. 2016-09-27 Programer Workflow Efficiency&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs_workflow">emacs_workflow</span></span></a></li>
<li><a href="#org6c95a96">3. 2016-09-27 Emacs Daemon MacOSX Workflow&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs_workflow">emacs_workflow</span></span></a></li>
<li><a href="#org17fa020">4. 2016-09-27 org mode - How to maintain an emacs-based knowledge base? - Stack Overflow&#xa0;&#xa0;&#xa0;<span class="tag"><span class="knowledgemanagement">knowledgemanagement</span></span></a></li>
<li><a href="#org7a01045">5. 2016-09-27 Use Emacs's Org-mode to Effectively Manage Small Projects - Emacs &amp; Emacsist&#xa0;&#xa0;&#xa0;<span class="tag"><span class="knowledgemanagement">knowledgemanagement</span></span></a></li>
<li><a href="#org2e138ae">6. 2016-09-28 ExcelHome - 全球领先的Excel门户,Office视频教程培训中心&#xa0;&#xa0;&#xa0;<span class="tag"><span class="excel">excel</span></span></a></li>
<li><a href="#org82f21ef">7. 2016-09-28 (1 条消息) 等额本息与等额本金，从财务管理的角度充分考虑货币时间价值，哪个对于购房人来说更划算？ - 知乎&#xa0;&#xa0;&#xa0;<span class="tag"><span class="fangdai">fangdai</span></span></a></li>
<li><a href="#orgae9be17">8. 2016-09-29 Mac下iPython－notebook搭建及使用 - whiterbear的专栏 - 博客频道 - CSDN.NET&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ipython">ipython</span>&#xa0;<span class="notebook">notebook</span></span></a></li>
<li><a href="#org9a66ac5">9. 2016-09-29 IPython Notebook: 交互计算新时代 | Mind on Mind&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notebook">notebook</span></span></a></li>
<li><a href="#org5dcf992">10. 2016-09-29 Index of /NewComer&#xa0;&#xa0;&#xa0;<span class="tag"><span class="reversecurity">reversecurity</span></span></a></li>
<li><a href="#org6557031">11. 2016-09-30 使用org-mode撰写jekyll博客&#xa0;&#xa0;&#xa0;<span class="tag"><span class="jekyll">jekyll</span>&#xa0;<span class="org">org</span>&#xa0;<span class="mode">mode</span>&#xa0;<span class="emacs">emacs</span></span></a></li>
<li><a href="#orgfb299e4">12. 2016-10-01 Gems | RubyGems.org | Ruby 社区 Gem 托管&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ruby">ruby</span>&#xa0;<span class="gemsource">gemsource</span></span></a></li>
<li><a href="#org462910a">13. <span class="todo __">未读</span> 2016-10-06 GFW翻墙小结 | HelloDog&#xa0;&#xa0;&#xa0;<span class="tag"><span class="gfw">gfw</span></span></a></li>
<li><a href="#orgc3e5063">14. <span class="todo __">未读</span> 2016-10-08 SSH Gymnastics and Tunneling with ProxyChains&#xa0;&#xa0;&#xa0;<span class="tag"><span class="gfw">gfw</span>&#xa0;<span class="ssh">ssh</span></span></a></li>
<li><a href="#orgc827f8b">15. 2016-10-08 四川人事考试网 — 新闻 市洲公招&#xa0;&#xa0;&#xa0;<span class="tag"><span class="liuqing">liuqing</span>&#xa0;<span class="gongzhao">gongzhao</span>&#xa0;<span class="gongwuyuan">gongwuyuan</span></span></a></li>
<li><a href="#org974afa6">16. 2016-10-08 一个客户端设置多个github账号 - tmyam's blog&#xa0;&#xa0;&#xa0;<span class="tag"><span class="github">github</span>&#xa0;<span class="multiuser">multiuser</span></span></a></li>
<li><a href="#org6268084">17. 2016-10-09 深度开源 - Java开源大全，开源信息发掘、分享、交流&#xa0;&#xa0;&#xa0;<span class="tag"><span class="opensource">opensource</span>&#xa0;<span class="doc">doc</span></span></a></li>
<li><a href="#orgd52f0b7">18. 2016-10-09 FOG Project&#xa0;&#xa0;&#xa0;<span class="tag"><span class="fog">fog</span></span></a></li>
<li><a href="#org26eb386">19. 2016-10-09 NMAP 基础教程 - he1renyagao&#xa0;&#xa0;&#xa0;<span class="tag"><span class="nmap">nmap</span></span></a></li>
<li><a href="#org6947efc">20. 2016-10-11 LVM (简体中文) - ArchWiki&#xa0;&#xa0;&#xa0;<span class="tag"><span class="lvm">lvm</span></span></a></li>
<li><a href="#orgd056b37">21. 2016-10-11 IEEE 802.1Q - 维基百科，自由的百科全书&#xa0;&#xa0;&#xa0;<span class="tag"><span class="vlan">vlan</span></span></a></li>
<li><a href="#org2a0b529">22. 2016-10-12 lexical scoping and dynamic scoping in Emacs Lisp | Yoo Box&#xa0;&#xa0;&#xa0;<span class="tag"><span class="_____">词法作用域</span>&#xa0;<span class="_____">动态作用域</span></span></a></li>
<li><a href="#orgf6a36f8">23. 2016-10-12 入门 | Elasticsearch权威指南（中文版）&#xa0;&#xa0;&#xa0;<span class="tag"><span class="es">es</span>&#xa0;<span class="Elasticsearch">Elasticsearch</span></span></a></li>
<li><a href="#org664d9aa">24. 2016-10-19 iproute2&#xa0;&#xa0;&#xa0;<span class="tag"><span class="iproute2">iproute2</span></span></a></li>
<li><a href="#org204e698">25. 2016-10-10 Introducing Linux Network Namespaces&#xa0;&#xa0;&#xa0;<span class="tag"><span class="network">network</span>&#xa0;<span class="namespace">namespace</span>&#xa0;<span class="virtual">virtual</span>&#xa0;<span class="ethernet">ethernet</span></span></a></li>
<li><a href="#orge0b86fd">26. 2016-10-20 Linux Switching – Interconnecting Namespaces – Open Cloud Blog&#xa0;&#xa0;&#xa0;<span class="tag"><span class="namespace">namespace</span>&#xa0;<span class="tap">tap</span>&#xa0;<span class="veth">veth</span></span></a></li>
<li><a href="#orge8838bc">27. 2016-10-21 Replace OS X Command+Tab with Witch – Raam Dev&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></a></li>
<li><a href="#org8f7e260">28. 2016-10-25 Ethernet frame - Wikipedia&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ethernet">ethernet</span></span></a></li>
<li><a href="#org7a9b814">29. 2016-10-25 Queue: Safari&#xa0;&#xa0;&#xa0;<span class="tag"><span class="safaribook">safaribook</span></span></a></li>
<li><a href="#orgf066cb6">30. 2016-10-28 学习编程道路上的入门书籍之Python篇 - 学习编程 - 知乎专栏&#xa0;&#xa0;&#xa0;<span class="tag"><span class="python_book">python_book</span></span></a></li>
<li><a href="#org1ad97e8">31. 2016-11-16 Tips for Using Mutt | W. Caleb McDaniel&#xa0;&#xa0;&#xa0;<span class="tag"><span class="mutt">mutt</span>&#xa0;<span class="macos">macos</span>&#xa0;<span class="attachment">attachment</span></span></a></li>
<li><a href="#org8f68bb6">32. 2016-11-22 字符编码笔记：ASCII，Unicode和UTF-8 - 阮一峰的网络日志&#xa0;&#xa0;&#xa0;<span class="tag"><span class="uft">uft</span>&#xa0;<span class="8">8</span>&#xa0;<span class="encodeing">encodeing</span></span></a></li>
<li><a href="#org6a7bdd2">33. 2016-11-22 The Absolute Minimum Every Software Developer Absolutely, Positively Must Know About Unicode and Character Sets (No Excuses!) - Joel on Software&#xa0;&#xa0;&#xa0;<span class="tag"><span class="encodeing">encodeing</span>&#xa0;<span class="__">编码</span></span></a></li>
<li><a href="#org829b5ed">34. 2017-04-05 "apple script"</a></li>
<li><a href="#org3dc9f55">35. 2017-05-02 "Python 线程与协程 - Yusheng's Tech Blog"</a></li>
<li><a href="#org6c0340b">36. 2017-05-05 "有哪些命令行的软件堪称神器？ - 知乎"&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tools">tools</span></span></a></li>
<li><a href="#org6537b57">37. 2017-05-05 "Kombu Documentation — Kombu 3.0.37 documentation"</a></li>
<li><a href="#orgee628d3">38. 2017-05-18 "Google 开源项目风格指南 (中文版) — Google 开源项目风格指南"&#xa0;&#xa0;&#xa0;<span class="tag"><span class="____">编程规范</span></span></a></li>
<li><a href="#org2d81cd9">39. <span class="todo __">未读</span> 2017-06-03 "Emacs: Align Text"&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs_sort_or_align">emacs_sort_or_align</span></span></a></li>
<li><a href="#org8785dc6">40. 2017-06-07 "hashlib - 廖雪峰的官方网站"</a></li>
<li><a href="#org42c5f70">41. 2017-06-13 "tigrc(5)" tig manual</a></li>
<li><a href="#org1667bd8">42. 2017-06-19 "lists.gnu.org"</a></li>
<li><a href="#org74c4e16">43. 2017-06-21 "(or emacs · irrelevant)" ivy作者的blog abo-abo</a></li>
<li><a href="#org4ba3ff3">44. 2017-06-21 "Don't just code: Career advice from the programming masters | InfoWorld"</a></li>
<li><a href="#org7513634">45. 2017-07-10 "浅显理解 Python 闭包 - I'm SErHo"</a></li>
<li><a href="#org8838886">46. 2017-07-10 "进程与线程的一个简单解释 - 阮一峰的网络日志"</a></li>
<li><a href="#org392e93f">47. 2017-07-18 "选择一个解释器 — The Hitchhiker's Guide to Python"</a></li>
<li><a href="#orgc869de9">48. 2017-07-31 "Gmail的OfflineIMAP XOAUTH2认证 | MaskRay"</a></li>
<li><a href="#org513a624">49. 2017-08-01 "EmacsWiki: Sending Mail"</a></li>
<li><a href="#org04d0f70">50. 2017-08-03 "Systemd 入门教程：命令篇 - 阮一峰的网络日志"</a></li>
<li><a href="#org3c1a0b5">51. 2017-08-03 "Linux 的启动流程 - 阮一峰的网络日志"</a></li>
<li><a href="#orgfaafcad">52. 2017-08-03 "计算机是如何启动的？ - 阮一峰的网络日志"</a></li>
<li><a href="#orgc77021d">53. 2017-09-13 如何制作网线</a></li>
<li><a href="#org49a489b">54. Using GNU Global with C++ and Git&#xa0;&#xa0;&#xa0;<span class="tag"><span class="gtags">gtags</span></span></a></li>
</ul>
</div>
</div>


<div id="outline-container-org5b00cb5" class="outline-2">
<h2 id="org5b00cb5"><span class="section-number-2">1</span> <a href="http://zhidao.baidu.com/question/32098049.html">2016-09-27 等额本息还贷和等额本金还贷有什么区别?</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="fangdai">fangdai</span></span></h2>
</div>
<div id="outline-container-org15e0e5c" class="outline-2">
<h2 id="org15e0e5c"><span class="section-number-2">2</span> <a href="http://ergoemacs.org/misc/programer_workflow_efficiency.html">2016-09-27 Programer Workflow Efficiency</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs_workflow">emacs_workflow</span></span></h2>
</div>
<div id="outline-container-org6c95a96" class="outline-2">
<h2 id="org6c95a96"><span class="section-number-2">3</span> <a href="https://coderwall.com/p/vbndzq/emacs-daemon-macosx-workflow">2016-09-27 Emacs Daemon MacOSX Workflow</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs_workflow">emacs_workflow</span></span></h2>
</div>
<div id="outline-container-org17fa020" class="outline-2">
<h2 id="org17fa020"><span class="section-number-2">4</span> <a href="http://stackoverflow.com/questions/2014636/how-to-maintain-an-emacs-based-knowledge-base">2016-09-27 org mode - How to maintain an emacs-based knowledge base? - Stack Overflow</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="knowledgemanagement">knowledgemanagement</span></span></h2>
</div>
<div id="outline-container-org7a01045" class="outline-2">
<h2 id="org7a01045"><span class="section-number-2">5</span> <a href="http://emacsist.com/10284">2016-09-27 Use Emacs's Org-mode to Effectively Manage Small Projects - Emacs &amp; Emacsist</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="knowledgemanagement">knowledgemanagement</span></span></h2>
</div>
<div id="outline-container-org2e138ae" class="outline-2">
<h2 id="org2e138ae"><span class="section-number-2">6</span> <a href="http://www.excelhome.net/">2016-09-28 ExcelHome - 全球领先的Excel门户,Office视频教程培训中心</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="excel">excel</span></span></h2>
</div>
<div id="outline-container-org82f21ef" class="outline-2">
<h2 id="org82f21ef"><span class="section-number-2">7</span> <a href="https://www.zhihu.com/question/21745865">2016-09-28 (1 条消息) 等额本息与等额本金，从财务管理的角度充分考虑货币时间价值，哪个对于购房人来说更划算？ - 知乎</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="fangdai">fangdai</span></span></h2>
</div>
<div id="outline-container-orgae9be17" class="outline-2">
<h2 id="orgae9be17"><span class="section-number-2">8</span> <a href="http://blog.csdn.net/whiterbear/article/details/49356815">2016-09-29 Mac下iPython－notebook搭建及使用 - whiterbear的专栏 - 博客频道 - CSDN.NET</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ipython">ipython</span>&#xa0;<span class="notebook">notebook</span></span></h2>
</div>
<div id="outline-container-org9a66ac5" class="outline-2">
<h2 id="org9a66ac5"><span class="section-number-2">9</span> <a href="http://mindonmind.github.io/2013/02/08/ipython-notebook-interactive-computing-new-era/">2016-09-29 IPython Notebook: 交互计算新时代 | Mind on Mind</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notebook">notebook</span></span></h2>
</div>
<div id="outline-container-org5dcf992" class="outline-2">
<h2 id="org5dcf992"><span class="section-number-2">10</span> <a href="http://172.16.2.250/NewComer/">2016-09-29 Index of /NewComer</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="reversecurity">reversecurity</span></span></h2>
</div>
<div id="outline-container-org6557031" class="outline-2">
<h2 id="org6557031"><span class="section-number-2">11</span> <a href="https://jsuper.github.io/emacs/using-org-mode-to-write-jekyll-post.html">2016-09-30 使用org-mode撰写jekyll博客</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="jekyll">jekyll</span>&#xa0;<span class="org">org</span>&#xa0;<span class="mode">mode</span>&#xa0;<span class="emacs">emacs</span></span></h2>
</div>
<div id="outline-container-orgfb299e4" class="outline-2">
<h2 id="orgfb299e4"><span class="section-number-2">12</span> <a href="https://rubygems.org/gems">2016-10-01 Gems | RubyGems.org | Ruby 社区 Gem 托管</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ruby">ruby</span>&#xa0;<span class="gemsource">gemsource</span></span></h2>
</div>
<div id="outline-container-org462910a" class="outline-2">
<h2 id="org462910a"><span class="section-number-2">13</span> <span class="todo __">未读</span> <a href="https://wsgzao.github.io/post/fq/">2016-10-06 GFW翻墙小结 | HelloDog</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="gfw">gfw</span></span></h2>
</div>
