archive/before-2018-11-10/2017-06-29-my-saved-website.html
<div id="outline-container-orgc3e5063" class="outline-2">
<h2 id="orgc3e5063"><span class="section-number-2">14</span> <span class="todo __">未读</span> <a href="http://magikh0e.ihtb.org/pubPapers/ssh_gymnastics_tunneling.html">2016-10-08 SSH Gymnastics and Tunneling with ProxyChains</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="gfw">gfw</span>&#xa0;<span class="ssh">ssh</span></span></h2>
</div>
<div id="outline-container-orgc827f8b" class="outline-2">
<h2 id="orgc827f8b"><span class="section-number-2">15</span> <a href="http://www.scpta.gov.cn/news/morenews.aspx?Id=50">2016-10-08 四川人事考试网 — 新闻 市洲公招</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="liuqing">liuqing</span>&#xa0;<span class="gongzhao">gongzhao</span>&#xa0;<span class="gongwuyuan">gongwuyuan</span></span></h2>
</div>
<div id="outline-container-org974afa6" class="outline-2">
<h2 id="org974afa6"><span class="section-number-2">16</span> <a href="http://tmyam.github.io/blog/2014/05/07/duo-githubzhang-hu-she-zhi/">2016-10-08 一个客户端设置多个github账号 - tmyam's blog</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="github">github</span>&#xa0;<span class="multiuser">multiuser</span></span></h2>
</div>
<div id="outline-container-org6268084" class="outline-2">
<h2 id="org6268084"><span class="section-number-2">17</span> <a href="http://www.open-open.com/">2016-10-09 深度开源 - Java开源大全，开源信息发掘、分享、交流</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="opensource">opensource</span>&#xa0;<span class="doc">doc</span></span></h2>
</div>
<div id="outline-container-orgd52f0b7" class="outline-2">
<h2 id="orgd52f0b7"><span class="section-number-2">18</span> <a href="https://fogproject.org/">2016-10-09 FOG Project</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="fog">fog</span></span></h2>
</div>
<div id="outline-container-org26eb386" class="outline-2">
<h2 id="org26eb386"><span class="section-number-2">19</span> <a href="https://jiji262.github.io/wooyun_articles/drops/NMAP%20%E5%9F%BA%E7%A1%80%E6%95%99%E7%A8%8B.html">2016-10-09 NMAP 基础教程 - he1renyagao</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="nmap">nmap</span></span></h2>
</div>
<div id="outline-container-org6947efc" class="outline-2">
<h2 id="org6947efc"><span class="section-number-2">20</span> <a href="https://wiki.archlinux.org/index.php/LVM_(%E7%AE%80%E4%BD%93%E4%B8%AD%E6%96%87)#.E4.BD.BF.E7.94.A8lvresize.E5.A2.9E.E5.8A.A0.E6.88.96.E7.BC.A9.E5.B0.8F.E5.AE.B9.E9.87.8F">2016-10-11 LVM (简体中文) - ArchWiki</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="lvm">lvm</span></span></h2>
</div>
<div id="outline-container-orgd056b37" class="outline-2">
<h2 id="orgd056b37"><span class="section-number-2">21</span> <a href="https://zh.wikipedia.org/wiki/IEEE_802.1Q">2016-10-11 IEEE 802.1Q - 维基百科，自由的百科全书</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="vlan">vlan</span></span></h2>
</div>
<div id="outline-container-org2a0b529" class="outline-2">
<h2 id="org2a0b529"><span class="section-number-2">22</span> <a href="https://yoo2080.wordpress.com/2011/12/31/lexical-scoping-and-dynamic-scoping-in-emacs-lisp/">2016-10-12 lexical scoping and dynamic scoping in Emacs Lisp | Yoo Box</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="_____">词法作用域</span>&#xa0;<span class="_____">动态作用域</span></span></h2>
</div>
<div id="outline-container-orgf6a36f8" class="outline-2">
<h2 id="orgf6a36f8"><span class="section-number-2">23</span> <a href="http://es.xiaoleilu.com/010_Intro/00_README.html">2016-10-12 入门 | Elasticsearch权威指南（中文版）</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="es">es</span>&#xa0;<span class="Elasticsearch">Elasticsearch</span></span></h2>
</div>
<div id="outline-container-org664d9aa" class="outline-2">
<h2 id="org664d9aa"><span class="section-number-2">24</span> <a href="file:///Users/pengpengxp/Documents/iproute2.html">2016-10-19 iproute2</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="iproute2">iproute2</span></span></h2>
</div>
<div id="outline-container-org204e698" class="outline-2">
<h2 id="org204e698"><span class="section-number-2">25</span> <a href="http://blog.scottlowe.org/2013/09/04/introducing-linux-network-namespaces/">2016-10-10 Introducing Linux Network Namespaces</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="network">network</span>&#xa0;<span class="namespace">namespace</span>&#xa0;<span class="virtual">virtual</span>&#xa0;<span class="ethernet">ethernet</span></span></h2>
</div>
<div id="outline-container-orge0b86fd" class="outline-2">
<h2 id="orge0b86fd"><span class="section-number-2">26</span> <a href="http://www.opencloudblog.com/?p=66">2016-10-20 Linux Switching – Interconnecting Namespaces – Open Cloud Blog</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="namespace">namespace</span>&#xa0;<span class="tap">tap</span>&#xa0;<span class="veth">veth</span></span></h2>
</div>
<div id="outline-container-orge8838bc" class="outline-2">
<h2 id="orge8838bc"><span class="section-number-2">27</span> <a href="https://raamdev.com/2007/replace-os-x-commandtab-with-witch/">2016-10-21 Replace OS X Command+Tab with Witch – Raam Dev</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></h2>
</div>
<div id="outline-container-org8f7e260" class="outline-2">
<h2 id="org8f7e260"><span class="section-number-2">28</span> <a href="https://en.wikipedia.org/wiki/Ethernet_frame">2016-10-25 Ethernet frame - Wikipedia</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="ethernet">ethernet</span></span></h2>
</div>
<div id="outline-container-org7a9b814" class="outline-2">
<h2 id="org7a9b814"><span class="section-number-2">29</span> <a href="https://www.safaribooksonline.com/s/?q=*&amp;filter=Python&amp;limit=30">2016-10-25 Queue: Safari</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="safaribook">safaribook</span></span></h2>
</div>
<div id="outline-container-orgf066cb6" class="outline-2">
<h2 id="orgf066cb6"><span class="section-number-2">30</span> <a href="https://zhuanlan.zhihu.com/p/22983834">2016-10-28 学习编程道路上的入门书籍之Python篇 - 学习编程 - 知乎专栏</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="python_book">python_book</span></span></h2>
</div>
<div id="outline-container-org1ad97e8" class="outline-2">
<h2 id="org1ad97e8"><span class="section-number-2">31</span> <a href="http://wcm1.web.rice.edu/mutt-tips.html">2016-11-16 Tips for Using Mutt | W. Caleb McDaniel</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="mutt">mutt</span>&#xa0;<span class="macos">macos</span>&#xa0;<span class="attachment">attachment</span></span></h2>
</div>
<div id="outline-container-org8f68bb6" class="outline-2">
<h2 id="org8f68bb6"><span class="section-number-2">32</span> <a href="http://www.ruanyifeng.com/blog/2007/10/ascii_unicode_and_utf-8.html">2016-11-22 字符编码笔记：ASCII，Unicode和UTF-8 - 阮一峰的网络日志</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="uft">uft</span>&#xa0;<span class="8">8</span>&#xa0;<span class="encodeing">encodeing</span></span></h2>
</div>
<div id="outline-container-org6a7bdd2" class="outline-2">
<h2 id="org6a7bdd2"><span class="section-number-2">33</span> <a href="http://www.joelonsoftware.com/articles/Unicode.html">2016-11-22 The Absolute Minimum Every Software Developer Absolutely, Positively Must Know About Unicode and Character Sets (No Excuses!) - Joel on Software</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="encodeing">encodeing</span>&#xa0;<span class="__">编码</span></span></h2>
</div>
<div id="outline-container-org829b5ed" class="outline-2">
<h2 id="org829b5ed"><span class="section-number-2">34</span> <a href="http://books.gigatux.nl/mirror/applescript/0596008503/toc.html">2017-04-05 "apple script"</a></h2>
</div>
<div id="outline-container-org3dc9f55" class="outline-2">
<h2 id="org3dc9f55"><span class="section-number-2">35</span> <a href="http://blog.rainy.im/2016/04/07/python-thread-and-coroutine/">2017-05-02 "Python 线程与协程 - Yusheng's Tech Blog"</a></h2>
</div>
<div id="outline-container-org6c0340b" class="outline-2">
<h2 id="org6c0340b"><span class="section-number-2">36</span> <a href="https://www.zhihu.com/question/59227720/answer/163594782?utm_medium=social&amp;utm_source=wechat_session">2017-05-05 "有哪些命令行的软件堪称神器？ - 知乎"</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="tools">tools</span></span></h2>
</div>
<div id="outline-container-org6537b57" class="outline-2">
<h2 id="org6537b57"><span class="section-number-2">37</span> <a href="https://kombu.readthedocs.io/en/latest/">2017-05-05 "Kombu Documentation — Kombu 3.0.37 documentation"</a></h2>
</div>
<div id="outline-container-orgee628d3" class="outline-2">
<h2 id="orgee628d3"><span class="section-number-2">38</span> <a href="http://zh-google-styleguide.readthedocs.io/en/latest/">2017-05-18 "Google 开源项目风格指南 (中文版) — Google 开源项目风格指南"</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="____">编程规范</span></span></h2>
</div>
<div id="outline-container-org2d81cd9" class="outline-2">
<h2 id="org2d81cd9"><span class="section-number-2">39</span> <span class="todo __">未读</span> <a href="http://ergoemacs.org/emacs/emacs_align_and_sort.html">2017-06-03 "Emacs: Align Text"</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs_sort_or_align">emacs_sort_or_align</span></span></h2>
</div>
<div id="outline-container-org8785dc6" class="outline-2">
<h2 id="org8785dc6"><span class="section-number-2">40</span> <a href="http://www.liaoxuefeng.com/wiki/001374738125095c955c1e6d8bb493182103fac9270762a000/0013868328251266d86585fc9514536a638f06b41908d44000">2017-06-07 "hashlib - 廖雪峰的官方网站"</a></h2>
</div>
<div id="outline-container-org42c5f70" class="outline-2">
<h2 id="org42c5f70"><span class="section-number-2">41</span> <a href="http://jonas.nitro.dk/tig/tigrc.5.html">2017-06-13 "tigrc(5)" tig manual</a></h2>
</div>
<div id="outline-container-org1667bd8" class="outline-2">
<h2 id="org1667bd8"><span class="section-number-2">42</span> <a href="http://lists.gnu.org/">2017-06-19 "lists.gnu.org"</a></h2>
</div>
<div id="outline-container-org74c4e16" class="outline-2">
<h2 id="org74c4e16"><span class="section-number-2">43</span> <a href="https://oremacs.com/">2017-06-21 "(or emacs · irrelevant)" ivy作者的blog abo-abo</a></h2>
</div>
<div id="outline-container-org4ba3ff3" class="outline-2">
<h2 id="org4ba3ff3"><span class="section-number-2">44</span> <a href="http://www.infoworld.com/article/3085150/application-development/dont-just-code-career-advice-from-the-programming-masters.html">2017-06-21 "Don't just code: Career advice from the programming masters | InfoWorld"</a></h2>
</div>
<div id="outline-container-org7513634" class="outline-2">
<h2 id="org7513634"><span class="section-number-2">45</span> <a href="https://serholiu.com/python-closures">2017-07-10 "浅显理解 Python 闭包 - I'm SErHo"</a></h2>
</div>
<div id="outline-container-org8838886" class="outline-2">
<h2 id="org8838886"><span class="section-number-2">46</span> <a href="http://www.ruanyifeng.com/blog/2013/04/processes_and_threads.html">2017-07-10 "进程与线程的一个简单解释 - 阮一峰的网络日志"</a></h2>
</div>
<div id="outline-container-org392e93f" class="outline-2">
<h2 id="org392e93f"><span class="section-number-2">47</span> <a href="http://pythonguidecn.readthedocs.io/zh/latest/starting/which-python.html">2017-07-18 "选择一个解释器 — The Hitchhiker's Guide to Python"</a></h2>
</div>
