archive/before-2018-11-10/source/2017-06-29-my-saved-website.org
* [[https://maskray.me/blog/2016-02-12-gmail-offlineimap-xoauth2][2017-07-31 "Gmail的OfflineIMAP XOAUTH2认证 | MaskRay"]]
* [[https://www.emacswiki.org/emacs/SendingMail][2017-08-01 "EmacsWiki: Sending Mail"]]
* [[http://www.ruanyifeng.com/blog/2016/03/systemd-tutorial-commands.html][2017-08-03 "Systemd 入门教程：命令篇 - 阮一峰的网络日志"]]
* [[http://www.ruanyifeng.com/blog/2013/08/linux_boot_process.html][2017-08-03 "Linux 的启动流程 - 阮一峰的网络日志"]]
* [[http://www.ruanyifeng.com/blog/2013/02/booting.html][2017-08-03 "计算机是如何启动的？ - 阮一峰的网络日志"]]
* [[http://zh.wikihow.com/%25E5%2588%25B6%25E4%25BD%259C%25E7%25BD%2591%25E7%25BA%25BF][2017-09-13 如何制作网线]]
* [[https://csl.name/post/gtags/][Using GNU Global with C++ and Git]]                                   :gtags:
  可以使用 =git= 的hook来更新gtags。好像还可以添加一个 =git gtags= 的
  命令。
