archive/before-2018-11-10/2017-06-29-my-saved-website.html
<div id="outline-container-orgc869de9" class="outline-2">
<h2 id="orgc869de9"><span class="section-number-2">48</span> <a href="https://maskray.me/blog/2016-02-12-gmail-offlineimap-xoauth2">2017-07-31 "Gmail的OfflineIMAP XOAUTH2认证 | MaskRay"</a></h2>
</div>
<div id="outline-container-org513a624" class="outline-2">
<h2 id="org513a624"><span class="section-number-2">49</span> <a href="https://www.emacswiki.org/emacs/SendingMail">2017-08-01 "EmacsWiki: Sending Mail"</a></h2>
</div>
<div id="outline-container-org04d0f70" class="outline-2">
<h2 id="org04d0f70"><span class="section-number-2">50</span> <a href="http://www.ruanyifeng.com/blog/2016/03/systemd-tutorial-commands.html">2017-08-03 "Systemd 入门教程：命令篇 - 阮一峰的网络日志"</a></h2>
</div>
<div id="outline-container-org3c1a0b5" class="outline-2">
<h2 id="org3c1a0b5"><span class="section-number-2">51</span> <a href="http://www.ruanyifeng.com/blog/2013/08/linux_boot_process.html">2017-08-03 "Linux 的启动流程 - 阮一峰的网络日志"</a></h2>
</div>
<div id="outline-container-orgfaafcad" class="outline-2">
<h2 id="orgfaafcad"><span class="section-number-2">52</span> <a href="http://www.ruanyifeng.com/blog/2013/02/booting.html">2017-08-03 "计算机是如何启动的？ - 阮一峰的网络日志"</a></h2>
</div>
<div id="outline-container-orgc77021d" class="outline-2">
<h2 id="orgc77021d"><span class="section-number-2">53</span> <a href="http://zh.wikihow.com/%E5%88%B6%E4%BD%9C%E7%BD%91%E7%BA%BF">2017-09-13 如何制作网线</a></h2>
</div>
<div id="outline-container-org49a489b" class="outline-2">
<h2 id="org49a489b"><span class="section-number-2">54</span> <a href="https://csl.name/post/gtags/">Using GNU Global with C++ and Git</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="gtags">gtags</span></span></h2>
<div class="outline-text-2" id="text-54">
<p>
可以使用 <code>git</code> 的hook来更新gtags。好像还可以添加一个 <code>git gtags</code> 的
命令。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>